NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32BG21/EFR32BG21B010F512IM32.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AGC_S</name>
      <version>0</version>
      <description>AGC_S Registers</description>
      <baseAddress>0xA800C000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>AGC</name>
        <value>31</value>
      </interrupt>
      <registers>
        <register>
          <name>IPVERSION</name>
          <description>No Description</description>
          <addressOffset>0x000</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IPVERSION</name>
              <description>IP Version</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EN</name>
          <description>No Description</description>
          <addressOffset>0x004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable peripheral clock to this module</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS0</name>
          <description>No Description</description>
          <addressOffset>0x008</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
          <fields>
            <field>
              <name>GAININDEX</name>
              <description>Gain Table Index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RFPKDLAT</name>
              <description>RFPKD Latch</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IFPKDLOLAT</name>
              <description>IFPKD Lo threshold pass Latch </description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IFPKDHILAT</name>
              <description>IFPKD Hi threshold pass Latch</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCA</name>
              <description>Clear Channel Assessment</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GAINOK</name>
              <description>Gain OK</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PGAINDEX</name>
              <description>PGA GAIN INDEX</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LNAINDEX</name>
              <description>LNA GAIN INDEX</description>
              <bitOffset>15</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PNINDEX</name>
              <description>PN GAIN INDEX</description>
              <bitOffset>19</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADCINDEX</name>
              <description>ADC Attenuator INDEX</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSSI</name>
          <description>No Description</description>
          <addressOffset>0x010</addressOffset>
          <access>read-only</access>
          <resetValue>0x00008000</resetValue>
          <resetMask>0x0000FFC0</resetMask>
          <fields>
            <field>
              <name>RSSIFRAC</name>
              <description>RSSI fractional part</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSSIINT</name>
              <description>RSSI integer part</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FRAMERSSI</name>
          <description>No Description</description>
          <addressOffset>0x014</addressOffset>
          <access>read-only</access>
          <resetValue>0x00008000</resetValue>
          <resetMask>0x0000FFC0</resetMask>
          <fields>
            <field>
              <name>FRAMERSSIFRAC</name>
              <description>FRAMERSSI fractional part</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FRAMERSSIINT</name>
              <description>FRAMERSSI integer part</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL0</name>
          <description>No Description</description>
          <addressOffset>0x01C</addressOffset>
          <access>read-write</access>
          <resetValue>0x2002727F</resetValue>
          <resetMask>0xFEEFFFFF</resetMask>
          <fields>
            <field>
              <name>PWRTARGET</name>
              <description>Power Target</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONT</name>
                  <description>AGC loop is adjusting gain continuously.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKPREDET</name>
                  <description>Gain is locked once a preamble is detected.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKFRAMEDET</name>
                  <description>Gain is locked once a sync word is detected.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKDSA</name>
                  <description>Gain is locked once DSA is detected.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSSISHIFT</name>
              <description>RSSI Shift</description>
              <bitOffset>11</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISCFLOOPADJ</name>
              <description>Disable gain adjustment by CFLOOP</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGCCLKUNDIVREQ</name>
              <description>Enable CLKUNDIV to AGC</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISRESETCHPWR</name>
              <description>Disable Reset of CHPWR</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCATTENMODE</name>
              <description>ADC Attenuator mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>ADC attenuator back-off will not be done by AGC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTMAXGAIN</name>
                  <description>ADC attenuator is backed-off if rxgain is NOT MAXGAIN</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCATTENCODE</name>
              <description>ADC Attenuator code</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENRSSIRESET</name>
              <description>Enables reset of RSSI and CCA</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSADISCFLOOP</name>
              <description>Disable channel filter loop</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISPNGAINUP</name>
              <description>Disable PN gain increase</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISPNDWNCOMP</name>
              <description>Disable PN gain decrease compensation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGCRST</name>
              <description>AGC reset</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL1</name>
          <description>No Description</description>
          <addressOffset>0x020</addressOffset>
          <access>read-write</access>
          <resetValue>0x00001300</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CCATHRSH</name>
              <description>Clear Channel Assessment (CCA) Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSIPERIOD</name>
              <description>RSSI measure period</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWRPERIOD</name>
              <description>AGC measure period</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUBPERIOD</name>
              <description>Subperiod</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUBNUM</name>
              <description>Subperiod numerator</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUBDEN</name>
              <description>Subperiod denominator</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUBINT</name>
              <description>Subperiod integer</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL2</name>
          <description>No Description</description>
          <addressOffset>0x024</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000610A</resetValue>
          <resetMask>0xC3FFFFFF</resetMask>
          <fields>
            <field>
              <name>DMASEL</name>
              <description>DMA select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RSSI</name>
                  <description>RSSI</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN</name>
                  <description>Gain</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAFEMODE</name>
              <description>AGC safe mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAFEMODETHD</name>
              <description>Enter threshold </description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REHICNTTHD</name>
              <description>Exit threshold based on HICNT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RELOTHD</name>
              <description>Exit threshold based on Release Counter</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RELBYCHPWR</name>
              <description>Safe mode release mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_CNT</name>
                  <description>Increment counter if IFPKD_LO_LAT signal is not set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWR</name>
                  <description>Increment counter if channel power is below RELTARGETPWR.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_CNT_PWR</name>
                  <description>Increment if either LO_CNT or PWR.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_CNT_AND_PWR</name>
                  <description>Increment if both LO_CNT and PWR.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RELTARGETPWR</name>
              <description>Safe Mode  Release Power Target</description>
              <bitOffset>18</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSDEBUGEN</name>
              <description>PRS Debug Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISRFPKD</name>
              <description>Disable RF PEAKDET</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL3</name>
          <description>No Description</description>
          <addressOffset>0x028</addressOffset>
          <access>read-write</access>
          <resetValue>0x02A8A800</resetValue>
          <resetMask>0x03FFFFFF</resetMask>
          <fields>
            <field>
              <name>IFPKDDEB</name>
              <description>IF PEAKDET debounce mode enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IFPKDDEBTHD</name>
              <description>IF PEAKDET debance thrshold</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IFPKDDEBPRD</name>
              <description>IF PEAKDET debance period</description>
              <bitOffset>3</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IFPKDDEBRST</name>
              <description>IF PEAKDET debounce period</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFPKDDEB</name>
              <description>RF PEAKDET debounce mode enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFPKDDEBTHD</name>
              <description>RF PEAKDET debance thrshold</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFPKDDEBPRD</name>
              <description>RF PEAKDET debance period</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFPKDDEBRST</name>
              <description>RFPKD_LAT debounce reset delay</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSSISTEPTHR</name>
          <description>No Description</description>
          <addressOffset>0x02C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>POSSTEPTHR</name>
              <description>Positive Step Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NEGSTEPTHR</name>
              <description>Negative Step Threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STEPPER</name>
              <description>Step Period</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEMODRESTARTPER</name>
              <description>Demodulator Restart Period</description>
              <bitOffset>17</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEMODRESTARTTHR</name>
              <description>Demodulator Restart Threshold</description>
              <bitOffset>21</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSIFAST</name>
              <description>RSSI fast startup</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>No Description</description>
          <addressOffset>0x038</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000007D</resetMask>
          <fields>
            <field>
              <name>RSSIVALID</name>
              <description>RSSI Value is Valid</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCA</name>
              <description>Clear Channel Assessment</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSIPOSSTEP</name>
              <description>Positive RSSI Step Detected</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSINEGSTEP</name>
              <description>Negative RSSI Step Detected</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHORTRSSIPOSSTEP</name>
              <description>Short-term Positive RSSI Step Detected</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
